import React from "react";

const Description = () => {
  return (
    <div className="w-[820px] h-[400px] flex justify-end flex-wrap pt-5 align-top ">
      <h2
        dir="rtl"
        className="myFontMiniBold text-[21px] text-[#263238] text-right"
      >
        اموزش رایگان html{" "}
      </h2>
      <h3
        dir="rtl"
        className="w-[720px] text-right text-[#455A64] text-[16px] "
      >
        محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش کدنویسی پیشرفته و
        تمیز؛ برای مسائل واقعی دنیای نرم افزار محبوب ترین کتابخانه ی جاوااسکریپت
        محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش کدنویسی پیشرفته و
        تمیز؛ محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش کدنویسی پیشرفته
        و تمیز
      </h3>
      <h2
        dir="rtl"
        className="myFontMiniBold text-[21px] text-[#263238] text-right"
      >
        اموزش رایگان برای چه کسانی مناسب است ؟{" "}
      </h2>
      <h3
        dir="rtl"
        className="w-[720px] text-right text-[#455A64] text-[16px] "
      >
        محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش کدنویسی پیشرفته و
        تمیز؛ برای مسائل واقعی دنیای نرم افزار محبوب ترین کتابخانه ی جاوااسکریپت
        محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش کدنویسی پیشرفته و
        تمیز؛ محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش کدنویسی پیشرفته
        و تمیز؛ محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش کدنویسی
        پیشرفته و تمیز؛ برای مسائل واقعی دنیای نرم افزار محبوب ترین کتابخانه ی
        جاوااسکریپت محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش کدنویسی
        پیشرفته و تمیز؛ محبوب ترین کتابخانه ی جاوااسکریپت حل مساله به روش
        کدنویسی پیشرفته و تمیز؛
      </h3>
    </div>
  );
};

export default Description;
