import React from "react";

const Description = () => {
  return (
    <div className="w-[820px]   flex justify-end flex-wrap pt-5 align-top ">
      <h3
        dir="rtl"
        className="w-[720px] text-right dark:text-white text-[#455A64] text-[16px] transition duration-300 ease-in-out"
      >
        امروزه ReactJs به سرعت در حال تبدیل شدن به یک ابزار بسیار قدرتمند برای
        ساخت وب اپلیکیشن ها است و خیلی از معروفترین سایت ها از جمله فیسبوک ,
        توییتر, نتفلیکس , یاهو , اینستاگرام و غیره همه در حال استفاده از این
        ابزار بسیار قدرتمند برای هرچه سریعتر و کارآمدتر کردن سایت و وب اپلیکیشن
        های خود هستند.\r\nری اکت برخلاف سایر رقبای خود که فریم ورک هستند یک
        کتابخانه جاوااسکریپت است پس نسبت به رقبای خود روند یادگیری کوتاه تری را
        دارد و یکی از بهترین ویژگی های ری اکت دادن قدرت انتخاب به توسعه دهندگان
        برای انتخاب ابزارهای مورد علاقه آنهاست برخلاف رقبای خود که توسعه دهندگان
        تنها باید از ابزارهای قرار داده شده استفاده کنند و در شرایطی با یک
        بروزرسانی کوچک باید اکثر مواردی که استفاده شده دوباره بعد یادگیری مجدد
        بازنویسی کنند.\r\nری اکت بسیار سریع و کارآمد و محبوبترین کتابخانه
        جاوااسکریپت می باشد به این معنی است که تعداد توسعه دهندگان بسیار زیادی
        دارد که این باعث می شود خیلی از ابزارهای مورد نیاز موجود باشد و مهمتر از
        همه هر سوالی که براتون پیش بیاد از قبل برای کسی پیش آمده و جوابش موجود
        هست.\r\n\r\nدر این دوره سعی میکنیم از صفر (مباحث پایه) شروع کنیم تا با
        ریتمی آهسته به همراه مثال و تمرینات به بخش های پیشرفته برسیم .این دوره
        دانشجو محور خواهد بود و تمامی نظرات شما دانشجویان عزیز درنظر گرفته می
        شود تا در کنار هم یک دوره کامل بسازیم.این دوره طوری طراحی شده است که بعد
        از اتمام بتوانید بدون نیاز به آموزش های دیگر راه خودتان را برای ورود به
        بازار کار و حرفه ایی شدن پیدا کنید.\r\n\r\nسرفصل های دوره :\r\n\r\nمعرفی
        دوره \r\n\r\nمباحث پایه ری اکت\r\n\r\nآشنایی با ContextAPI و
        Hooks\r\n\r\nیادگیری React Router\r\n\r\nیادگیری Material UI\r\n\r\nنحوه
        Build و آنلاین کردن اپلیکیشن ری اکتی\r\n\r\nیادگیری Redux و Redux
        Thunk\r\n\r\nیادگیری مباحث پایه NextJs\r\n\r\nآشنایی با ‍PWA\r\n\r\nتست
        نویسی در ری اکت توسط کتابخانه Jest",
      </h3>
    </div>
  );
};

export default Description;
